#include <stdio.h>

//与或非
//int main() {
    //逻辑与
//    int x = 5;
//    int y = 10;
//    if (x > 0 && y < 20) {
//        // 当 x 大于 0 且 y 小于 20 时执行这里的代码
//        printf("x 和 y 的值都满足条件\n");
//    } else {
//        printf("x 和 y 的值都不满足条件\n");
//    }


    //逻辑或
//    int x = 5;
//    int y = 25;
//    if (x > 10 || y < 26) {
//        // 当 x 大于 10 或 y 小于 20 时执行这里的代码
//        printf("x 或 y 的值满足条件\n");
//    }


     //逻辑非
//    int x = 5;
//    if (!(x > 10)) {
//        // 当 x 不大于 10 时执行这里的代码
//        printf("x 的值不满足条件\n");
//    }

//    return 0;
//}
